[Killed] BlockStatement
src/components/Auth.tsx:30:30
 
 const AuthContext = createContext<undefined | UseAuthReturn>(undefined);
 
-export const useAuth = () => {
-  const auth = useContext(AuthContext);
-
-  if (!auth)
-    throw Error('useAuth must be invoked in a decendent of <AuthProvider />');
-
-  return auth;
-};
+export const useAuth = () => {};
 
 //
killedBy: Auth Component & Provider should log error if ProtectedByRole is rendered without auth
statusReason: Cannot destructure property 'auth' of 'useAuth(...)' as it is undefined.

[Killed] ConditionalExpression
src/components/Auth.tsx:33:7
 export const useAuth = () => {
   const auth = useContext(AuthContext);
 
-  if (!auth)
+  if (true)
     throw Error('useAuth must be invoked in a decendent of <AuthProvider />');
 
killedBy: Auth Component & Provider should log error if ProtectedByRole is rendered without auth
statusReason: useAuth must be invoked in a decendent of <AuthProvider />

[Killed] BooleanLiteral
src/components/Auth.tsx:33:7
 export const useAuth = () => {
   const auth = useContext(AuthContext);
 
-  if (!auth)
+  if (auth)
     throw Error('useAuth must be invoked in a decendent of <AuthProvider />');
 
killedBy: Auth Component & Provider should log error if ProtectedByRole is rendered without auth
statusReason: useAuth must be invoked in a decendent of <AuthProvider />

[Killed] StringLiteral
src/components/Auth.tsx:34:17
   const auth = useContext(AuthContext);
 
   if (!auth)
-    throw Error('useAuth must be invoked in a decendent of <AuthProvider />');
+    throw Error("");
 
   return auth;
killedBy: Auth Component & Provider should throw error if useAuth is used outside of Provider
statusReason: expected [Function] to throw error including 'useAuth must be invoked' but got ''

[Killed] BooleanLiteral
src/components/Auth.tsx:46:56
 }
 
 export const Provider = ({ children }: AuthProviderProps) => {
-  const [isInitialising, setIsInitialising] = useState(true);
+  const [isInitialising, setIsInitialising] = useState(false);
   const [isLoading, setIsLoading] = useState(false);
   const [state, setState] = useState<null | LogInRes>(null);
killedBy: Auth Component & Provider should initialise and show no user if verification fails
statusReason: Unable to find an element by: [data-testid="initialising"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="no-user"

[Survived] BooleanLiteral
src/components/Auth.tsx:47:46
 
 export const Provider = ({ children }: AuthProviderProps) => {
   const [isInitialising, setIsInitialising] = useState(true);
-  const [isLoading, setIsLoading] = useState(false);
+  const [isLoading, setIsLoading] = useState(true);
   const [state, setState] = useState<null | LogInRes>(null);
 

[Killed] BlockStatement
src/components/Auth.tsx:52:57
 
   const { toast } = useToast();
 
-  const logIn = (username: string, password: string) => {
-    setIsLoading(true);
-
-    api
-      .logIn({ username, password })
-      .then((res) => setState(res))
-      .catch(() =>
-        toast(
-          createErrorToast({
-            verbLabel: 'log in',
-            dataLabel: 'user',
-          }),
-        ),
-      )
-      .finally(() => setIsLoading(false));
-  };
+  const logIn = (username: string, password: string) => {};
 
   const logOut = () => {
killedBy: Auth Component & Provider should update state on successful login
statusReason: Unable to find an element by: [data-testid="user-info"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="no-user"

[Killed] BooleanLiteral
src/components/Auth.tsx:53:18
   const { toast } = useToast();
 
   const logIn = (username: string, password: string) => {
-    setIsLoading(true);
+    setIsLoading(false);
 
     api
killedBy: Auth Component & Provider should show loading state during login
statusReason: Unable to find an element by: [data-testid="loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="no-user"

[Killed] ArrowFunction
src/components/Auth.tsx:57:13
 
     api
       .logIn({ username, password })
-      .then((res) => setState(res))
+      .then(() => undefined)
       .catch(() =>
         toast(
killedBy: Auth Component & Provider should update state on successful login
statusReason: Unable to find an element by: [data-testid="user-info"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="no-user"

[Killed] ArrowFunction
src/components/Auth.tsx:58:14
     api
       .logIn({ username, password })
       .then((res) => setState(res))
-      .catch(() =>
-        toast(
-          createErrorToast({
-            verbLabel: 'log in',
-            dataLabel: 'user',
-          }),
-        ),
+      .catch(() => undefined,
       )
       .finally(() => setIsLoading(false));
killedBy: Auth Component & Provider should show toast on failed login
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/components/Auth.tsx:61:24
       .catch(() =>
         toast(
           createErrorToast({
-            verbLabel: 'log in',
+            verbLabel: "",
             dataLabel: 'user',
           }),
killedBy: Auth Component & Provider should show toast on failed login
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ArrowFunction
src/components/Auth.tsx:66:16
           }),
         ),
       )
-      .finally(() => setIsLoading(false));
+      .finally(() => undefined);
   };
 
killedBy: Auth Component & Provider should show loading state during login
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="loading"
>
  Loading...
</div> instead

[Killed] BooleanLiteral
src/components/Auth.tsx:66:35
           }),
         ),
       )
-      .finally(() => setIsLoading(false));
+      .finally(() => setIsLoading(true));
   };
 
killedBy: Auth Component & Provider should show loading state during login
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="loading"
>
  Loading...
</div> instead

[Killed] BlockStatement
src/components/Auth.tsx:69:24
       .finally(() => setIsLoading(false));
   };
 
-  const logOut = () => {
-    if (state) {
-      setIsLoading(true);
-
-      api
-        .logOut()
-        .then(() => setState(null))
-        .catch(() =>
-          toast(
-            createErrorToast({
-              verbLabel: 'log out',
-              dataLabel: 'user',
-            }),
-          ),
-        )
-        .finally(() => setIsLoading(false));
-    }
-  };
+  const logOut = () => {};
 
   useEffect(() => {
killedBy: Auth Component & Provider should clear state on logout
statusReason: Unable to find an element by: [data-testid="no-user"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="user-info"

[Killed] BlockStatement
src/components/Auth.tsx:70:16
   };
 
   const logOut = () => {
-    if (state) {
-      setIsLoading(true);
-
-      api
-        .logOut()
-        .then(() => setState(null))
-        .catch(() =>
-          toast(
-            createErrorToast({
-              verbLabel: 'log out',
-              dataLabel: 'user',
-            }),
-          ),
-        )
-        .finally(() => setIsLoading(false));
-    }
+    if (state) {}
   };
 
killedBy: Auth Component & Provider should clear state on logout
statusReason: Unable to find an element by: [data-testid="no-user"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="user-info"

[Killed] ConditionalExpression
src/components/Auth.tsx:70:9
   };
 
   const logOut = () => {
-    if (state) {
+    if (false) {
       setIsLoading(true);
 
killedBy: Auth Component & Provider should clear state on logout
statusReason: Unable to find an element by: [data-testid="no-user"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="user-info"

[Survived] BooleanLiteral
src/components/Auth.tsx:71:20
 
   const logOut = () => {
     if (state) {
-      setIsLoading(true);
+      setIsLoading(false);
 
       api

[Killed] ArrowFunction
src/components/Auth.tsx:75:15
 
       api
         .logOut()
-        .then(() => setState(null))
+        .then(() => undefined)
         .catch(() =>
           toast(
killedBy: Auth Component & Provider should clear state on logout
statusReason: Unable to find an element by: [data-testid="no-user"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="user-info"

[Killed] ArrowFunction
src/components/Auth.tsx:76:16
       api
         .logOut()
         .then(() => setState(null))
-        .catch(() =>
-          toast(
-            createErrorToast({
-              verbLabel: 'log out',
-              dataLabel: 'user',
-            }),
-          ),
+        .catch(() => undefined,
         )
         .finally(() => setIsLoading(false));
killedBy: Auth Component & Provider should show toast on failed logout
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/components/Auth.tsx:79:26
         .catch(() =>
           toast(
             createErrorToast({
-              verbLabel: 'log out',
+              verbLabel: "",
               dataLabel: 'user',
             }),
killedBy: Auth Component & Provider should show toast on failed logout
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/components/Auth.tsx:88:19
     }
   };
 
-  useEffect(() => {
-    /**
-     * This is how we check our authentication cookies' validity, i.e. are we
-     * authorized. Since all requests go through the refresh middleware
-     * (see [auth/api.ts](../data/auth/api.ts), if the verify request fails with
-     * a 401, the middleware will attempt to refresh the session.
-     *
-     * Therefore, on refresh success, run verify again to retrieve session
-     * information*.
-     **/
-
-    const verify = () => api.verifyAuth().then((res) => setState(res));
-
-    verify()
-      .catch((err) => err.refreshSuccess && verify())
-      .finally(() => setIsInitialising(false));
-  }, []);
+  useEffect(() => {}, []);
 
   useEffect(() => {
killedBy: Auth Component & Provider should initialise and show no user if verification fails
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="initialising"
>
  Initialising...
</div> instead

[Killed] ArrowFunction
src/components/Auth.tsx:99:48
      * information*.
      **/
 
-    const verify = () => api.verifyAuth().then((res) => setState(res));
+    const verify = () => api.verifyAuth().then(() => undefined);
 
     verify()
killedBy: Auth Component & Provider should initialise and show user if verification succeeds
statusReason: Unable to find an element by: [data-testid="user-info"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="no-user"

[Killed] ArrowFunction
src/components/Auth.tsx:99:20
      * information*.
      **/
 
-    const verify = () => api.verifyAuth().then((res) => setState(res));
+    const verify = () => undefined;
 
     verify()
killedBy: Auth Component & Provider should log error if ProtectedByRole is rendered without auth
statusReason: Cannot read properties of undefined (reading 'catch')

[Killed] ConditionalExpression
src/components/Auth.tsx:102:23
     const verify = () => api.verifyAuth().then((res) => setState(res));
 
     verify()
-      .catch((err) => err.refreshSuccess && verify())
+      .catch((err) => true)
       .finally(() => setIsInitialising(false));
   }, []);
killedBy: Auth Component & Provider should verify again on refreshSuccess
statusReason: Unable to find an element by: [data-testid="user-info"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="no-user"

[Killed] ConditionalExpression
src/components/Auth.tsx:102:23
     const verify = () => api.verifyAuth().then((res) => setState(res));
 
     verify()
-      .catch((err) => err.refreshSuccess && verify())
+      .catch((err) => false)
       .finally(() => setIsInitialising(false));
   }, []);
killedBy: Auth Component & Provider should verify again on refreshSuccess
statusReason: Unable to find an element by: [data-testid="user-info"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="no-user"

[Killed] ArrowFunction
src/components/Auth.tsx:103:16
 
     verify()
       .catch((err) => err.refreshSuccess && verify())
-      .finally(() => setIsInitialising(false));
+      .finally(() => undefined);
   }, []);
 
killedBy: Auth Component & Provider should initialise and show no user if verification fails
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="initialising"
>
  Initialising...
</div> instead

[Killed] BooleanLiteral
src/components/Auth.tsx:103:40
 
     verify()
       .catch((err) => err.refreshSuccess && verify())
-      .finally(() => setIsInitialising(false));
+      .finally(() => setIsInitialising(true));
   }, []);
 
killedBy: Auth Component & Provider should initialise and show no user if verification fails
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="initialising"
>
  Initialising...
</div> instead

[Killed] BlockStatement
src/components/Auth.tsx:106:19
       .finally(() => setIsInitialising(false));
   }, []);
 
-  useEffect(() => {
-    /**
-     * Any failed fresh request means we are no longer signed in. By setting
-     * state to null our UI
-     **/
-
-    api.subscribeToRefreshFailed(() => {
-      setIsLoading(false);
-      setState(null);
-    });
-  }, []);
+  useEffect(() => {}, []);
 
   const context: UseAuthReturn = {
killedBy: Auth Component & Provider should handle refresh failed subscription
statusReason: refreshFailedCb is not a function

[Survived] BlockStatement
src/components/Auth.tsx:112:40
      * state to null our UI
      **/
 
-    api.subscribeToRefreshFailed(() => {
-      setIsLoading(false);
-      setState(null);
-    });
+    api.subscribeToRefreshFailed(() => {});
   }, []);
 

[Survived] BooleanLiteral
src/components/Auth.tsx:113:20
      **/
 
     api.subscribeToRefreshFailed(() => {
-      setIsLoading(false);
+      setIsLoading(true);
       setState(null);
     });

[Killed] ObjectLiteral
src/components/Auth.tsx:118:34
     });
   }, []);
 
-  const context: UseAuthReturn = {
-    isInitialising,
-    isLoading,
-    logIn,
-    logOut,
-    auth: state,
-  };
+  const context: UseAuthReturn = {};
 
   return (
killedBy: Auth Component & Provider should initialise and show no user if verification fails
statusReason: Unable to find an element by: [data-testid="initialising"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <div
        data-testid="no-user"

[Killed] BooleanLiteral
src/components/Auth.tsx:151:7
   const navigate = useNavigate();
   const { auth } = useAuth();
 
-  if (!auth) {
+  if (auth) {
     console.error(
       '<ProtectedByRole /> was rendered when there was not an authenticated user, users should se a sign in page if verification failed....',
killedBy: Auth Component & Provider should log error if ProtectedByRole is rendered without auth
statusReason: Cannot read properties of null (reading 'roles')

[Killed] ConditionalExpression
src/components/Auth.tsx:151:7
   const navigate = useNavigate();
   const { auth } = useAuth();
 
-  if (!auth) {
+  if (false) {
     console.error(
       '<ProtectedByRole /> was rendered when there was not an authenticated user, users should se a sign in page if verification failed....',
killedBy: Auth Component & Provider should log error if ProtectedByRole is rendered without auth
statusReason: Cannot read properties of null (reading 'roles')

[Killed] MethodExpression
src/components/Auth.tsx:158:8
     return null;
   }
 
-  if (!roles.every((role) => auth.roles.includes(role))) {
+  if (!roles.some(role => auth.roles.includes(role))) {
     if (redirectPath) return <Navigate to={redirectPath} replace />;
 
killedBy: Auth Component & Provider ProtectedByRole should NOT render content if user has only some of the required roles
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="protected-content"
>
  Secret Content
</div> instead

[Killed] ConditionalExpression
src/components/Auth.tsx:158:7
     return null;
   }
 
-  if (!roles.every((role) => auth.roles.includes(role))) {
+  if (true) {
     if (redirectPath) return <Navigate to={redirectPath} replace />;
 
killedBy: Auth Component & Provider ProtectedByRole should render content if user has ALL required roles
statusReason: Unable to find an element by: [data-testid="protected-content"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/components/Auth.tsx:159:9
   }
 
   if (!roles.every((role) => auth.roles.includes(role))) {
-    if (redirectPath) return <Navigate to={redirectPath} replace />;
+    if (true) return <Navigate to={redirectPath} replace />;
 
     if (renderLandingPage) {
killedBy: Auth Component & Provider ProtectedByRole should go back when clicking button in landing page
statusReason: Unable to find role="button" and name `/go back/i`

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] ConditionalExpression
src/components/Auth.tsx:159:9
   }
 
   if (!roles.every((role) => auth.roles.includes(role))) {
-    if (redirectPath) return <Navigate to={redirectPath} replace />;
+    if (false) return <Navigate to={redirectPath} replace />;
 
     if (renderLandingPage) {

[Killed] ConditionalExpression
src/components/Auth.tsx:161:9
   if (!roles.every((role) => auth.roles.includes(role))) {
     if (redirectPath) return <Navigate to={redirectPath} replace />;
 
-    if (renderLandingPage) {
+    if (true) {
       return (
         <Message
killedBy: Auth Component & Provider ProtectedByRole should return null if no access and no landing page/redirect
statusReason: expected <div …(1)>…(3)</div> to be null

[Killed] BlockStatement
src/components/Auth.tsx:161:28
   if (!roles.every((role) => auth.roles.includes(role))) {
     if (redirectPath) return <Navigate to={redirectPath} replace />;
 
-    if (renderLandingPage) {
-      return (
-        <Message
-          className="h-full"
-          icon={Hand}
-          message="You do not have permission to view this content"
-        >
-          <Button onClick={() => navigate(-1)}>Go back</Button>
-        </Message>
-      );
-    }
+    if (renderLandingPage) {}
 
     return null;
killedBy: Auth Component & Provider ProtectedByRole should go back when clicking button in landing page
statusReason: Unable to find role="button" and name `/go back/i`

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] UnaryOperator
src/components/Auth.tsx:168:43
           icon={Hand}
           message="You do not have permission to view this content"
         >
-          <Button onClick={() => navigate(-1)}>Go back</Button>
+          <Button onClick={() => navigate(+1)}>Go back</Button>
         </Message>
       );

[Survived] ArrowFunction
src/components/Auth.tsx:168:28
           icon={Hand}
           message="You do not have permission to view this content"
         >
-          <Button onClick={() => navigate(-1)}>Go back</Button>
+          <Button onClick={() => undefined}>Go back</Button>
         </Message>
       );
