[Killed] ArrowFunction
src/components/ConfirmConvertDialog.tsx:34:5
   const vehiclesQ = useVehiclesQ();
 
   const badges: Badge[] = useMemo(
-    () =>
-      !vehiclesQ.data
-        ? []
-        : vehicleIds
-            .map((id) => vehiclesQ.data.find((v) => v.id === id))
-            .filter((v) => !!v)
-            .map((v) => ({
-              label: v.isCustomerOwned ? `#${v.id}` : v.regTag,
-              variant: 'secondary',
-              tooltip: capitalize(v.vehicleType),
-            })),
+    () => undefined,
     [vehiclesQ.data],
   );
killedBy: ConfirmConvertDialog Component should render title, description and badges
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BooleanLiteral
src/components/ConfirmConvertDialog.tsx:35:7
 
   const badges: Badge[] = useMemo(
     () =>
-      !vehiclesQ.data
+      vehiclesQ.data
         ? []
         : vehicleIds
killedBy: ConfirmConvertDialog Component should render title, description and badges
statusReason: Unable to find an element with the text: ABC-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Survived] ArrayDeclaration
src/components/ConfirmConvertDialog.tsx:36:11
   const badges: Badge[] = useMemo(
     () =>
       !vehiclesQ.data
-        ? []
+        ? ["Stryker was here"]
         : vehicleIds
             .map((id) => vehiclesQ.data.find((v) => v.id === id))

[Killed] MethodExpression
src/components/ConfirmConvertDialog.tsx:37:11
     () =>
       !vehiclesQ.data
         ? []
-        : vehicleIds
-            .map((id) => vehiclesQ.data.find((v) => v.id === id))
-            .filter((v) => !!v)
+        : vehicleIds.map(id => vehiclesQ.data.find(v => v.id === id))
             .map((v) => ({
               label: v.isCustomerOwned ? `#${v.id}` : v.regTag,
killedBy: ConfirmConvertDialog Component should call onConfirm when Convert button is clicked
statusReason: Cannot read properties of undefined (reading 'isCustomerOwned')

[Killed] ArrowFunction
src/components/ConfirmConvertDialog.tsx:38:18
       !vehiclesQ.data
         ? []
         : vehicleIds
-            .map((id) => vehiclesQ.data.find((v) => v.id === id))
+            .map(() => undefined)
             .filter((v) => !!v)
             .map((v) => ({
killedBy: ConfirmConvertDialog Component should render title, description and badges
statusReason: Unable to find an element with the text: ABC-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Killed] ConditionalExpression
src/components/ConfirmConvertDialog.tsx:38:53
       !vehiclesQ.data
         ? []
         : vehicleIds
-            .map((id) => vehiclesQ.data.find((v) => v.id === id))
+            .map((id) => vehiclesQ.data.find((v) => true))
             .filter((v) => !!v)
             .map((v) => ({
killedBy: ConfirmConvertDialog Component should render title, description and badges
statusReason: Found multiple elements with the text: ABC-123

Here are the matching elements:

Ignored nodes: comments, script, style
<span>
  ABC-123
</span>

[Killed] BooleanLiteral
src/components/ConfirmConvertDialog.tsx:39:28
         ? []
         : vehicleIds
             .map((id) => vehiclesQ.data.find((v) => v.id === id))
-            .filter((v) => !!v)
+            .filter((v) => !v)
             .map((v) => ({
               label: v.isCustomerOwned ? `#${v.id}` : v.regTag,
killedBy: ConfirmConvertDialog Component should render title, description and badges
statusReason: Unable to find an element with the text: ABC-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Killed] ArrowFunction
src/components/ConfirmConvertDialog.tsx:40:18
         : vehicleIds
             .map((id) => vehiclesQ.data.find((v) => v.id === id))
             .filter((v) => !!v)
-            .map((v) => ({
-              label: v.isCustomerOwned ? `#${v.id}` : v.regTag,
-              variant: 'secondary',
-              tooltip: capitalize(v.vehicleType),
-            })),
+            .map(() => undefined),
     [vehiclesQ.data],
   );
killedBy: ConfirmConvertDialog Component should render title, description and badges
statusReason: Cannot read properties of undefined (reading 'label')

[Killed] StringLiteral
src/components/ConfirmConvertDialog.tsx:41:42
             .map((id) => vehiclesQ.data.find((v) => v.id === id))
             .filter((v) => !!v)
             .map((v) => ({
-              label: v.isCustomerOwned ? `#${v.id}` : v.regTag,
+              label: v.isCustomerOwned ? `` : v.regTag,
               variant: 'secondary',
               tooltip: capitalize(v.vehicleType),
killedBy: ConfirmConvertDialog Component should render title, description and badges
statusReason: Unable to find an element with the text: #2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Killed] StringLiteral
src/components/ConfirmConvertDialog.tsx:53:29
       <DialogHeader>
         <DialogTitle>{`${title}`}</DialogTitle>
 
-        <DialogDescription>{`${description}`}</DialogDescription>
+        <DialogDescription>{``}</DialogDescription>
         <div className="w-full pt-1.5 [&>div]:flex-wrap">
           <BadgeGroup limit={20} badges={badges} />
killedBy: ConfirmConvertDialog Component should render title, description and badges
statusReason: Unable to find an element with the text: Are you sure?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Killed] ConditionalExpression
src/components/ConfirmConvertDialog.tsx:60:10
       </DialogHeader>
 
       <DialogFooter>
-        {onClose && (
-          <DialogClose asChild>
-            <Button variant="outline" type="button" onClick={onClose}>
-              Cancel
-            </Button>
-          </DialogClose>
-        )}
+        {false}
         <DialogClose asChild>
           <IconButton
killedBy: ConfirmConvertDialog Component should call onClose when Cancel button is clicked
statusReason: Unable to find an accessible element with the role "button" and name `/cancel/i`

Here are the accessible roles:

  heading:

  Name "Title":
  <h2 />

[Killed] ConditionalExpression
src/components/ConfirmConvertDialog.tsx:60:10
       </DialogHeader>
 
       <DialogFooter>
-        {onClose && (
-          <DialogClose asChild>
-            <Button variant="outline" type="button" onClick={onClose}>
-              Cancel
-            </Button>
-          </DialogClose>
-        )}
+        {true}
         <DialogClose asChild>
           <IconButton
killedBy: ConfirmConvertDialog Component should call onClose when Cancel button is clicked
statusReason: Unable to find an accessible element with the role "button" and name `/cancel/i`

Here are the accessible roles:

  heading:

  Name "Title":
  <h2 />
