[Killed] MethodExpression
src/components/UpdateVehicleStatusesDialog.tsx:35:35
   const { closeCurrentDialog } = useDialogManager();
 
   const handleConfirm = async () => {
-    const vehiclesWithoutStatus = vehicles.filter(
-      (vehicle) => !vehicleStatuses[vehicle.id],
-    );
+    const vehiclesWithoutStatus = vehicles;
     if (vehiclesWithoutStatus.length > 0) {
       toast(
killedBy: UpdateVehicleStatusesDialog Component should call mutation and close dialog on success
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
src/components/UpdateVehicleStatusesDialog.tsx:36:20
 
   const handleConfirm = async () => {
     const vehiclesWithoutStatus = vehicles.filter(
-      (vehicle) => !vehicleStatuses[vehicle.id],
+      (vehicle) => vehicleStatuses[vehicle.id],
     );
     if (vehiclesWithoutStatus.length > 0) {
killedBy: UpdateVehicleStatusesDialog Component should show error toast and NOT close if statuses are missing
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ArrowFunction
src/components/UpdateVehicleStatusesDialog.tsx:36:7
 
   const handleConfirm = async () => {
     const vehiclesWithoutStatus = vehicles.filter(
-      (vehicle) => !vehicleStatuses[vehicle.id],
+      () => undefined,
     );
     if (vehiclesWithoutStatus.length > 0) {
killedBy: UpdateVehicleStatusesDialog Component should show error toast and NOT close if statuses are missing
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/components/UpdateVehicleStatusesDialog.tsx:38:9
     const vehiclesWithoutStatus = vehicles.filter(
       (vehicle) => !vehicleStatuses[vehicle.id],
     );
-    if (vehiclesWithoutStatus.length > 0) {
+    if (vehiclesWithoutStatus.length >= 0) {
       toast(
         createErrorToast({
killedBy: UpdateVehicleStatusesDialog Component should call mutation and close dialog on success
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/components/UpdateVehicleStatusesDialog.tsx:38:43
     const vehiclesWithoutStatus = vehicles.filter(
       (vehicle) => !vehicleStatuses[vehicle.id],
     );
-    if (vehiclesWithoutStatus.length > 0) {
-      toast(
-        createErrorToast({
-          verbLabel: 'choose',
-          dataLabel: 'status for all vehicles',
-        }),
-      );
-      return;
-    }
+    if (vehiclesWithoutStatus.length > 0) {}
 
     try {
killedBy: UpdateVehicleStatusesDialog Component should show error toast and NOT close if statuses are missing
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/components/UpdateVehicleStatusesDialog.tsx:48:9
       return;
     }
 
-    try {
-      await Promise.all(
-        vehicles.map((vehicle) =>
-          updateVehicleStatusM.mutateAsync({
-            id: vehicle.id.toString(),
-            vehicleStatus: vehicleStatuses[vehicle.id],
-          }),
-        ),
-      );
-
-      toast(
-        createSuccessToast({
-          verbLabel: 'update',
-          dataLabel: 'vehicle statuses',
-        }),
-      );
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error during update of vehicle:', error);
       toast(
killedBy: UpdateVehicleStatusesDialog Component should call mutation and close dialog on success
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
src/components/UpdateVehicleStatusesDialog.tsx:50:22
 
     try {
       await Promise.all(
-        vehicles.map((vehicle) =>
-          updateVehicleStatusM.mutateAsync({
-            id: vehicle.id.toString(),
-            vehicleStatus: vehicleStatuses[vehicle.id],
-          }),
+        vehicles.map(() => undefined,
         ),
       );
killedBy: UpdateVehicleStatusesDialog Component should call mutation and close dialog on success
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Survived] ObjectLiteral
src/components/UpdateVehicleStatusesDialog.tsx:51:44
     try {
       await Promise.all(
         vehicles.map((vehicle) =>
-          updateVehicleStatusM.mutateAsync({
-            id: vehicle.id.toString(),
-            vehicleStatus: vehicleStatuses[vehicle.id],
-          }),
+          updateVehicleStatusM.mutateAsync({}),
         ),
       );

[Killed] StringLiteral
src/components/UpdateVehicleStatusesDialog.tsx:61:22
       toast(
         createSuccessToast({
           verbLabel: 'update',
-          dataLabel: 'vehicle statuses',
+          dataLabel: "",
         }),
       );
killedBy: UpdateVehicleStatusesDialog Component should call mutation and close dialog on success
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/components/UpdateVehicleStatusesDialog.tsx:64:21
           dataLabel: 'vehicle statuses',
         }),
       );
-    } catch (error) {
-      console.error('Error during update of vehicle:', error);
-      toast(
-        createErrorToast({
-          verbLabel: 'update',
-          dataLabel: 'vehicle statuses',
-        }),
-      );
-      return;
-    }
+    } catch (error) {}
 
     closeCurrentDialog();
killedBy: UpdateVehicleStatusesDialog Component should show error toast if mutation fails
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/components/UpdateVehicleStatusesDialog.tsx:68:22
       console.error('Error during update of vehicle:', error);
       toast(
         createErrorToast({
-          verbLabel: 'update',
+          verbLabel: "",
           dataLabel: 'vehicle statuses',
         }),
killedBy: UpdateVehicleStatusesDialog Component should show error toast if mutation fails
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/components/UpdateVehicleStatusesDialog.tsx:90:21
       <div className="space-y-4">
         {vehicles.map((vehicle) => (
           <div key={vehicle.id}>
-            <label>{vehicle.regTag || `Vehicle ${vehicle.id}`}</label>
+            <label>{false}</label>
             <Select.Root
               value={vehicleStatuses[vehicle.id] || ''}
killedBy: UpdateVehicleStatusesDialog Component should render vehicle list and status selectors
statusReason: Unable to find an element with the text: ABC-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Killed] LogicalOperator
src/components/UpdateVehicleStatusesDialog.tsx:90:21
       <div className="space-y-4">
         {vehicles.map((vehicle) => (
           <div key={vehicle.id}>
-            <label>{vehicle.regTag || `Vehicle ${vehicle.id}`}</label>
+            <label>{vehicle.regTag && `Vehicle ${vehicle.id}`}</label>
             <Select.Root
               value={vehicleStatuses[vehicle.id] || ''}
killedBy: UpdateVehicleStatusesDialog Component should render vehicle list and status selectors
statusReason: Unable to find an element with the text: ABC-123. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Survived] ConditionalExpression
src/components/UpdateVehicleStatusesDialog.tsx:92:22
           <div key={vehicle.id}>
             <label>{vehicle.regTag || `Vehicle ${vehicle.id}`}</label>
             <Select.Root
-              value={vehicleStatuses[vehicle.id] || ''}
+              value={false}
               onValueChange={(value) =>
                 setVehicleStatuses((prev) => ({

[Survived] LogicalOperator
src/components/UpdateVehicleStatusesDialog.tsx:92:22
           <div key={vehicle.id}>
             <label>{vehicle.regTag || `Vehicle ${vehicle.id}`}</label>
             <Select.Root
-              value={vehicleStatuses[vehicle.id] || ''}
+              value={vehicleStatuses[vehicle.id] && ''}
               onValueChange={(value) =>
                 setVehicleStatuses((prev) => ({

[Killed] ArrowFunction
src/components/UpdateVehicleStatusesDialog.tsx:93:30
             <label>{vehicle.regTag || `Vehicle ${vehicle.id}`}</label>
             <Select.Root
               value={vehicleStatuses[vehicle.id] || ''}
-              onValueChange={(value) =>
-                setVehicleStatuses((prev) => ({
-                  ...prev,
-                  [vehicle.id]: value as VehicleStatus,
-                }))
+              onValueChange={() => undefined
               }
             >
killedBy: UpdateVehicleStatusesDialog Component should call mutation and close dialog on success
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
src/components/UpdateVehicleStatusesDialog.tsx:94:36
             <Select.Root
               value={vehicleStatuses[vehicle.id] || ''}
               onValueChange={(value) =>
-                setVehicleStatuses((prev) => ({
-                  ...prev,
-                  [vehicle.id]: value as VehicleStatus,
-                }))
+                setVehicleStatuses(() => undefined)
               }
             >
killedBy: UpdateVehicleStatusesDialog Component should call mutation and close dialog on success
statusReason: Unable to find an accessible element with the role "button" and name `/confirm/i`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/components/UpdateVehicleStatusesDialog.tsx:104:51
                 <Select.Value placeholder="Choose status" />
               </Select.Trigger>
               <Select.Content>
-                {Object.values(VehicleStatus).map((status) => (
-                  <Select.Item key={status} value={status}>
-                    {status
-                      .toLowerCase()
-                      .split('_')
-                      .map(
-                        (word) => word.charAt(0).toUpperCase() + word.slice(1),
-                      )
-                      .join(' ')}
-                  </Select.Item>
-                ))}
+                {Object.values(VehicleStatus).map(() => undefined)}
               </Select.Content>
             </Select.Root>
killedBy: UpdateVehicleStatusesDialog Component should format status labels correctly
statusReason: Unable to find an element with the text: Available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Killed] MethodExpression
src/components/UpdateVehicleStatusesDialog.tsx:106:22
               <Select.Content>
                 {Object.values(VehicleStatus).map((status) => (
                   <Select.Item key={status} value={status}>
-                    {status
-                      .toLowerCase()
+                    {status.toUpperCase()
                       .split('_')
                       .map(
killedBy: UpdateVehicleStatusesDialog Component should format status labels correctly
statusReason: Unable to find an element with the text: Available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Killed] StringLiteral
src/components/UpdateVehicleStatusesDialog.tsx:108:30
                   <Select.Item key={status} value={status}>
                     {status
                       .toLowerCase()
-                      .split('_')
+                      .split("")
                       .map(
                         (word) => word.charAt(0).toUpperCase() + word.slice(1),
killedBy: UpdateVehicleStatusesDialog Component should format status labels correctly
statusReason: Unable to find an element with the text: Available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Killed] MethodExpression
src/components/UpdateVehicleStatusesDialog.tsx:110:35
                       .toLowerCase()
                       .split('_')
                       .map(
-                        (word) => word.charAt(0).toUpperCase() + word.slice(1),
+                        (word) => word.charAt(0).toLowerCase() + word.slice(1),
                       )
                       .join(' ')}
killedBy: UpdateVehicleStatusesDialog Component should format status labels correctly
statusReason: Unable to find an element with the text: Available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Killed] MethodExpression
src/components/UpdateVehicleStatusesDialog.tsx:110:66
                       .toLowerCase()
                       .split('_')
                       .map(
-                        (word) => word.charAt(0).toUpperCase() + word.slice(1),
+                        (word) => word.charAt(0).toUpperCase() + word,
                       )
                       .join(' ')}
killedBy: UpdateVehicleStatusesDialog Component should format status labels correctly
statusReason: Unable to find an element with the text: Available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="dialog-content"
    >

[Survived] StringLiteral
src/components/UpdateVehicleStatusesDialog.tsx:112:29
                       .map(
                         (word) => word.charAt(0).toUpperCase() + word.slice(1),
                       )
-                      .join(' ')}
+                      .join("")}
                   </Select.Item>
                 ))}
